Tekla.Structures.Model.Reinforcement.RebarGeometryOptionEnum
Options for the function GetRebarGeometries.

Tekla.Structures.Model.Reinforcement.RebarGeometryOptionEnum.NONE
No hooks or clash avoidance or length adjustment.

Tekla.Structures.Model.Reinforcement.RebarGeometryOptionEnum.HOOKS
Hooks.

Tekla.Structures.Model.Reinforcement.RebarGeometryOptionEnum.AVOID_CLASH
In case rebar polygon clashes with itself, physical points are moved to avoid clashing.

Tekla.Structures.Model.Reinforcement.RebarGeometryOptionEnum.LENGTH_ADJUSTMENTS
Length adjustments